snlkuharlocal/src/Documents/ДДС_ВнешнихКонтрагентов/ДДС_ВнешнихКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДДС_ВнешнихКонтрагентов</name>
  <registerRecords>AccumulationRegister.ДДС_ВнешнихКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипыРасчетаДенежнымиСредствами/ТипыРасчетаДенежнымиСредствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаДенежнымиСредствами</name>
  <comment>Типы расчета денежными средствами для кассового чека</comment>
  <enumValues>
    <name>ПриходДенежныхСредств</name>
    <comment>Чек продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредств</name>
    <comment>Чек возврата продажи</comment>
  </enumValues>
  <enumValues>
    <name>РасходДенежныхСредств</name>
    <comment>Чек покупки</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратРасходаДенежныхСредств</name>
    <comment>Чек возврата покупки</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ДДС_ВнешнихКонтрагентов/ObjectModule.bsl
Перем ТДВ,ДвиженияПоОстаткамДДС_ВК;
   
   
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика. 
	ОбъектКопирования.сумма = 0;
	
КонецПроцедуры



#Область Проводки

Функция СоздатьТаблицуДвижений(ИмяРегистра)
	Набор=РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	
	Возврат Набор.Выгрузить();	
КонецФункции // СоздатьТаблицуДвижений(ИмяРегистра) 


Функция ПроведениеПоРегиструОстаткиДДС_ВК(ДокументСсылка,Движения,Загрузка=Ложь) Экспорт	
	
	результат = 1;
	ТекДок = Документссылка;
	
	ДатаДокумента=ТекДок.Дата;
	
	ДвиженияПоОстаткамДДС_ВК = СоздатьТаблицуДвижений("ДДС_ВнешнихКонтрагентов");
	
	Если ТекДок.КодОперации = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств 
		или  ТекДок.КодОперации = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств
		
	Тогда
		Запись = ДвиженияПоОстаткамДДС_ВК.Добавить();
		Запись.Активность = Истина;
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Период = Дата;
		Запись.контрагент = контрагент;
		Запись.Сумма = ТекДок.сумма;
		Запись.КодОперации = ТекДок.кодОперации;
		Запись.договор = ТекДок.договор; 
		Запись.валюта = ТекДок.валюта; 
		Запись.комментарий = ТекДок.комментарий;
	Иначе
		Запись = ДвиженияПоОстаткамДДС_ВК.Добавить();
		Запись.Активность = Истина;
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Период = Дата;
		Запись.контрагент = контрагент;
		Запись.Сумма = ТекДок.сумма;
		Запись.КодОперации = ТекДок.кодОперации; 
		Запись.договор = ТекДок.договор; 
		Запись.валюта = ТекДок.валюта; 
		Запись.комментарий = ТекДок.комментарий;

	КонецЕсли;
		
	
	Возврат Результат;
	
КонецФункции  

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	
	ИмяРегистра = "ДДС_ВнешнихКонтрагентов";
	ТаблицаДвижения = ДвиженияПоРегистрам; 
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	     
	
КонецПроцедуры 

#КонецОбласти

   

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	  	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

	
	РезультатПроведения = ПроведениеПоРегиструОстаткиДДС_ВК(Ссылка,ДвиженияПоОстаткамДДС_ВК);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамДДС_ВК, истина);
	
	       		
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	если Валюта=Справочники.Валюты.ПустаяСсылка() тогда
		Валюта=Справочники.Валюты.НайтиПоКоду("810");
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	 
	
	Если Контрагент.Пустая() ТОгда
		Сообщить(" Заполните контрагента!");
		возврат;
	КонецЕсли;	
	
	Если КодОперации.Пустая() ТОгда
		Сообщить(" Заполните код операции!");
		возврат;
	КонецЕсли;	
	
	если Валюта=Справочники.Валюты.ПустаяСсылка() тогда
		Валюта=Справочники.Валюты.НайтиПоКоду("810");
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	 
	
	Если Контрагент.Пустая() ТОгда
		Сообщить(" Заполните контрагента!");
		возврат;
	КонецЕсли;	
	
	Если КодОперации.Пустая() ТОгда
		Сообщить(" Заполните код операции!");
		возврат;
	КонецЕсли;	
	
	Если  ЗначениеЗаполнено(Ссылка)  Тогда 
		ЕстьИзменения	=Модифицированность();
		НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
		
		Если НЕ ОбменДанными.Загрузка Тогда
			КонтрольДатыЗапрета(ЭтотОбъект.Ссылка,Отказ,истина);
			///МожноЗаписатьДокумент(ЭтотОбъект.ссылка,Отказ,РежимЗаписи,Истина);
			///МожноИзменятьДокумент(ЭтотОбъект.Ссылка,Отказ,Истина);
			
			Если Отказ Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Комментарий";
			Сообщение.Текст = " Нельзя редактировать документ в закрытом периоде";
			Сообщение.Сообщить();
						
			
			Возврат КонецЕсли;   
			
			
			
			Если Отказ Тогда Возврат КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
		

	
	

КонецПроцедуры
